#!/usr/bin/env python

import sys


def replace_with_map(m, s):
    for k, v in m.items():
        s = s.replace(k, v)

    return s


alternatives = {'說':'説'}

booktitles = {'説文':'《説文》',
             '爾雅':'《爾雅》',
             '廣雅':'《廣雅》',
             '博雅':'《博雅》',
             '方言':'《方言》',
             '字林':'《字林》',
             '詩':'《詩》',
             '易':'《易》',
             '虞書':'《虞書》',
             '商書':'《商書》',
             '周書':'《周書》',
             '禹貢':'《禹貢》',
             '春秋傳':'《春秋傳》',
             '周禮':'《周禮》',
             '周官':'《周官》',
             '考工記':'《考工記》',
             '山海經':'《山海經》',
             '神異經':'《神異經》',
             '管子':'《管子》',
             '列子':'《列子》',
             '漢書':'《漢書》',
             '史記':'《史記》',
}


fixed = {
    '切':'切。',
    '也':'也。',
    '皃':'皃。',
    '名':'名。',

    '一曰':'一曰，',
    '徐鍇曰':'徐鍇曰，',
    '臣光按':'臣光按，',
    '臣光曰':'臣光曰，',

    '縣名':'，縣名',

    '文一':'。文一',
    '文二':'。文二',
    '文三':'。文三',
    '文四':'。文四',
    '文五':'。文五',
    '文六':'。文六',
    '文七':'。文七',
    '文八':'。文八',
    '文九':'。文九',

    '徐邈讀':'徐邈讀。',

    '又':'。又',
    '又並':'。又並',
    '又作':'。又作',
    '通作':'。通作',
    '或从':'。或从',
    '或作':'。或作',
    '古作':'。古作',
    '亦書作':'。亦書作',

    '引《':'。引',
    '】《詩》':'】詩',

    '。。。。。。。。':'。',
    '。。。。。。。':'。',
    '。。。。。。':'。',
    '。。。。。':'。',
    '。。。。':'。',
    '。。。':'。',
    '。。':'。',
}

def punct(s):
    for m in [alternatives, booktitles, fixed]:
        s = replace_with_map(m, s)

    return s



for line in sys.stdin:
    print(punct(line[:-1]))


        
